In [1]:
import pandas as pd

In [21]:
df = pd.read_csv('covid_worldwide.csv')   #reads from the file
df.columns = df.columns.str.strip().str.replace(' ', '_').str.lower()  #removes the spaces between two words in a column and replaces it with an underscore the convert to lower

In [33]:
df.drop(['serial_number'], axis=1, inplace=True) #drops the coulumn serial number

In [34]:
df.columns  # wala it dropped

Index(['country', 'total_cases', 'total_deaths', 'total_recovered',
       'active_cases', 'total_test', 'population'],
      dtype='object')

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 231 entries, 0 to 230
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   country          231 non-null    object
 1   total_cases      231 non-null    object
 2   total_deaths     225 non-null    object
 3   total_recovered  210 non-null    object
 4   active_cases     212 non-null    object
 5   total_test       213 non-null    object
 6   population       228 non-null    object
dtypes: object(7)
memory usage: 12.8+ KB

In [47]:
df.isna().sum() # gets the total nimber of null values in each column

country             0
total_cases         0
total_deaths        6
total_recovered    21
active_cases       19
total_test         18
population          3
dtype: int64

In [55]:

df1 = df.fillna('0') #fills the null values with 0 instead

In [57]:
df1.replace({',': ''}, regex=True, inplace=True) # this removes every , in the rows

In [58]:
df1 #It worked just fine again

,country,total_cases,total_deaths,total_recovered,active_cases,total_test,population
0,USA,104196861,1132935,101322779,1741147,1159832679,334805269
1,India,44682784,530740,44150289,1755,915265788,1406631776
2,France,39524311,164233,39264546,95532,271490188,65584518
3,Germany,37779833,165711,37398100,216022,122332384,83883596
4,Brazil,36824580,697074,35919372,208134,63776166,215353593
...,...,...,...,...,...,...,...
226,Diamond Princess,712,13,699,0,0,0
227,Vatican City,29,0,29,0,0,799
228,Western Sahara,10,1,9,0,0,626161
229,MS Zaandam,9,2,7,0,0,0
230,Tokelau,5,0,0,5,0,1378

In [59]:
df1.describe() #this just describes the data that's all

,country,total_cases,total_deaths,total_recovered,active_cases,total_test,population
count,231,231,231,231,231,231,231
unique,231,231,214,211,181,213,229
top,USA,104196861,0,0,0,0,0
freq,1,1,6,21,27,18,3

In [60]:
df1.isna().sum()

country            0
total_cases        0
total_deaths       0
total_recovered    0
active_cases       0
total_test         0
population         0
dtype: int64

In [62]:
df1['country'].nunique()

231

In [63]:
df1 #our data is all cleaned up and ready to be used for analysis

,country,total_cases,total_deaths,total_recovered,active_cases,total_test,population
0,USA,104196861,1132935,101322779,1741147,1159832679,334805269
1,India,44682784,530740,44150289,1755,915265788,1406631776
2,France,39524311,164233,39264546,95532,271490188,65584518
3,Germany,37779833,165711,37398100,216022,122332384,83883596
4,Brazil,36824580,697074,35919372,208134,63776166,215353593
...,...,...,...,...,...,...,...
226,Diamond Princess,712,13,699,0,0,0
227,Vatican City,29,0,29,0,0,799
228,Western Sahara,10,1,9,0,0,626161
229,MS Zaandam,9,2,7,0,0,0
230,Tokelau,5,0,0,5,0,1378

In [64]:
df1.to_csv('cleaned_covid_worldwide.csv', index=False) #finally we saved it to a file.